Revit 2024 API
CompoundStructure.GetDeckProfileId Method
 Retrieves the profile loop used for the specified structural deck.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ElementId GetDeckProfileId(
	int layerIdx
)
Visual Basic
Public Function GetDeckProfileId ( _
	layerIdx As Integer _
) As ElementId
Visual C++
public:
ElementId^ GetDeckProfileId(
	int layerIdx
)
Parameters
layerIdx
Type: System.Int32
 Index of a layer in the CompoundStructure.
Return Value
 The element id of a FamilySymbol which contains a profile loop used by a structural deck associated to the specified layer, or invalidElementId if isStructuralDeck(layerIdx) is false.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The layer index is out of range.
See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace